class Order < ActiveRecord::Base
  belongs_to  :faculty
  TYPE_ORDER = { 0 => 'Приказ', 3 => 'Приказ 1 курс 1 семестр',1 => 'Протокол академической стипендии', 2 => 'Протокол социальной стипендии'}

  LIST = { 0 => ["Ректор","В.И. Кошкин"],
           1 => ["Проректор по социальным вопросам и воспитательной работе","Е.А. Осипов"],
           2 => ["Главный бухгалтер","И.А. Дьячкова"],
           3 => ["Начальник Правового управления","О.В. Сгибнева"],
           4 => ["Начальник Планово-финансового отдела","Н.В. Таганова"],
           5 => ["Декан ФПМТФ","А.И. Мартыненко"]
  }

  validates_inclusion_of :type_order, in: TYPE_ORDER.keys,
  message: "Тип приказа должен быть заполнин"
  validates_presence_of :number
end
