class Order < ActiveRecord::Base
  belongs_to  :faculty
  belongs_to  :pay_category_to_semester

  TYPE_ORDER = {
      0 => 'Приказ',
      3 => 'Приказ 1 курс 1 семестр',
      1 => 'Протокол академической стипендии',
      4 => 'Протокол академической стипендии 1 курс 1 семестр',
      2 => 'Протокол социальной стипендии',
      5 => 'Протокол социальной стипендии 1 курс 1 семестр'
  }

  STATUS = {
      0 => 'НЕ ГОТОВ',
      1 => 'Подписан'
  }

  LIST = { 0 => ["Ректор","В.И. Кошкин"],
           1 => ["Главный бухгалтер","C.А. Третьякова"],
           2 => ["Начальник Юридического отдела","Т.Н. Мартынова"],
           3 => ["Начальник Планово-финансового отдела","Н.В. Таганова"],
           4 => ["Начальник Управления по воспитательной и социальной работе","Д.А. Бункин"]
  }

  LIST2 = {
      3 => {
          0 => 'А.И. Мартыненко',
          1 => 'С.И. Союстова',
          2 => 'Е.В. Афанасьева',
          3 => 'А.Г. Горьковой',
          4 => 'И.Р. Литвинцев'
      },
      7 => {
          0 => 'А.И. Мартыненко',
          1 => 'С.И. Союстова',
          2 => 'Е.В. Афанасьева',
          3 => 'А.Г. Горьковой',
          4 => 'И.Р. Литвинцев'
      },
      10 => {
          0 => 'Л.А. Марюшин',
          1 => 'Е.В. Афанасьева',
          2 => 'С.И. Союстова',
          3 => 'А.Г. Горьковой',
          4 => 'И.Р. Литвинцев'
      },
      6 => {
          0 =>'А.А.А.А.',
          1 => 'Е.В. Афанасьева',
          2 => 'С.И. Союстова',
          3 => 'А.Г. Горьковой',
          4 => 'И.Р. Литвинцев'
      }
  }

  FACULTY = {
      7 => 'А.И. Мартыненко',
      3 => 'А.И. Мартыненко',
      10 => 'Л.А. Марюшин',
      6 => 'А.А.А.А.'
  }

  FACULTY0 = {
      7 => 'А.И. Мартыненко',
      3 => 'А.И. Мартыненко',
      10 => 'Л.А. Марюшина',
      6 => 'А.А.А.А.'
  }

  validates_inclusion_of :status, in: STATUS.keys,
  message: "Статус приказа должен быть заполнин"
  validates_inclusion_of :type_order, in: TYPE_ORDER.keys,
  message: "Тип приказа должен быть заполнин"
  validates_presence_of :number,
                        message: "Номер приказа должен быть заполнин"
end
