class Order < ActiveRecord::Base
  belongs_to  :faculty
  TYPE_ORDER = { 0 => 'Приказ', 3 => 'Приказ 1 курс 1 семестр',1 => 'Протокол академической стипендии', 2 => 'Протокол социальной стипендии'}

  LIST = { 0 => ["Ректор","В.И. Кошкин"],
           1 => ["Главный бухгалтер","C.А. Третьякова"],
           2 => ["Начальник Юридического отдела","Т.Н. Мартынова"],
           3 => ["Начальник Планово-финансового отдела","Н.В. Таганова"],
           4 => ["Начальник Управления по воспитательной и социальной работе","Д.А. Бункин"]
  }

  FACULTY = {
      7 => 'А.И. Мартыненко',
      3 => 'А.И. Мартыненко',
      10 => 'Л.А. Марюшин',
      6 => 'А.А.А.А.'
  }

  validates_inclusion_of :type_order, in: TYPE_ORDER.keys,
  message: "Тип приказа должен быть заполнин"
  validates_presence_of :number
end
